{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "Localization System Tutorial"
			},
			"Translation":
			{
				"Text": "Samouczek Systemu Lokalizacji"
			},
			"Key": "ProjectDisplayedTitle"
		},
		{
			"Source":
			{
				"Text": "Localization System Tutorial - Debug"
			},
			"Translation":
			{
				"Text": "Samouczek Systemu Lokalizacji - Debug"
			},
			"Key": "ProjectDebugTitleInfo"
		}
	],
	"Subnamespaces": [
		{
			"Namespace": "Asset_Direct",
			"Children": [
				{
					"Source":
					{
						"Text": "This is a text literal asigned directly in TextBlock's Text property."
					},
					"Translation":
					{
						"Text": "To jest literał tekstowy przypisany bezpośrednio w polu Text należącym do kontrolki TextBlock."
					},
					"Key": "textliteral_asset_1"
				}
			]
		},
		{
			"Namespace": "Cpp_Namespace_1",
			"Children": [
				{
					"Source":
					{
						"Text": "This is the first text literal created in code."
					},
					"Translation":
					{
						"Text": "To jest pierwszy literał tekstowy stworzony w kodzie."
					},
					"Key": "Cpp_TextLiteral_1"
				}
			]
		},
		{
			"Namespace": "Cpp_Namespace_2",
			"Children": [
				{
					"Source":
					{
						"Text": "This is the second text literal created in code."
					},
					"Translation":
					{
						"Text": "To jest drugi literał tekstowy stworzony w kodzie."
					},
					"Key": "Cpp_TextLiteral_2"
				}
			]
		},
		{
			"Namespace": "ST_Animals",
			"Children": [
				{
					"Source":
					{
						"Text": "cat"
					},
					"Translation":
					{
						"Text": "kot"
					},
					"Key": "st_cpp_animals_cat"
				},
				{
					"Source":
					{
						"Text": "dog"
					},
					"Translation":
					{
						"Text": "pies"
					},
					"Key": "st_cpp_animals_dog"
				}
			]
		},
		{
			"Namespace": "ST_Fruits",
			"Children": [
				{
					"Source":
					{
						"Text": "apple"
					},
					"Translation":
					{
						"Text": "jabłko"
					},
					"Key": "st_asset_fruits_apple"
				},
				{
					"Source":
					{
						"Text": "banana"
					},
					"Translation":
					{
						"Text": "banan"
					},
					"Key": "st_asset_fruits_banana"
				}
			]
		},
		{
			"Namespace": "ST_Weapons",
			"Children": [
				{
					"Source":
					{
						"Text": "axe"
					},
					"Translation":
					{
						"Text": "topór"
					},
					"Key": "st_cpp_weapons_axe"
				},
				{
					"Source":
					{
						"Text": "bow"
					},
					"Translation":
					{
						"Text": "łuk"
					},
					"Key": "st_cpp_weapons_bow"
				},
				{
					"Source":
					{
						"Text": "sword"
					},
					"Translation":
					{
						"Text": "miecz"
					},
					"Key": "st_cpp_weapons_sword"
				}
			]
		}
	]
}